{
  "news": [
    {
      "NewsId": 1,
      "type": "Sport",
      "img": "/src/assets/Sport/Lionel-Messi.png",
      "subTitle": "An angry Lionel Messi is good for Argentina — and scary for opponents",
      "title": "Argentina's Lionel Messi is hungry to end his time on the national team with a World Cup title and that bodes well for those tuning into his match Tuesday.",
      "description": "DOHA, Qatar – Lionel Messi is angry, and your reaction to those words will mean something different depending on who you are, where you come from and what you wish to happen from this closing week of the World Cup.Messi being royally ticked off is a headache in the here and now if you’re a Croatia player, coach or fan. It’s not great news if you’re tied to France or Morocco, either; though in that instance, it likely feels like a problem for future days.For everyone else, especially those who wish well for Argentina’s soccer maestro, one of soccer’s enduring human treasures, Messi getting annoyed is a really, really good thing",
      "like": 0,
      "disLike": 0,
      "tag":"'messi','Argentina','Cup','Qatar','World Cup','sports'"
    },
    {
      "NewsId": 2,
      "type": "Sport",
      "img": "/src/assets/Sport/messi.jpg",
      "subTitle": "Lionel Messi’s World Cup pursuit has become the world’s shared dream",
      "title": "Lionel Messi and Argentina will take on France in the World Cup final on Sunday in what will be Messi's last appearance for his country.",
      "description": "According to the sports books, there will be no favorite when Argentina and France take the field in Sunday’s World Cup final (coverage begins at 9 a.m. ET, FOX and the FOX Sports app). That’s not stopping the Argentines from embracing — manufacturing — an underdog role ahead of the match against the defending champions.People can say that the favorites are France. We always like to hear that the opponent is the favorite,goalkeeper Emiliano Martínez said Saturday at his team’s final press conference before the decisive contest. He couldn’t help then adding a qualifier.",
      "like": 0,
      "disLike": 0,
      "tag":"'messi','Argentina','Cup','Qatar','final','World Cup','sports'"
    },
    {
      "NewsId": 3,
      "type": "Sport",
      "img": "/src/assets/Sport/qatar.jpg",
      "subTitle": "Why this has been a culturally unique World Cup",
      "title": "Breaking ground in the Middle East and played for the first time in the European winter, it was always going to look and feel different",
      "description": "Qatar was described by some as the most controversial World Cup tournament host, with criticism ranging from alleged corruption in the bidding process to a callous disregard for human rights.It is undoubtedly right to shine a light on the deaths and conditions endured by migrant workers to make this tournament happen, and LGBTQ and women’s rights too, although some Qataris might wonder why their country came under such intense criticism when countries with questionable human rights records, or laws that curtail the freedoms of certain members of society, have also hosted major sporting events in recent years.The last World Cup was held in Russia, for example, a country that has made it illegal for anyone to promote same-sex relationships or suggest that non-heterosexual orientations are “normal.”",
      "like": 0,
      "disLike": 0,
      "tag":"'World Cup','Cup','Qatar','World Cup','sports'"
    },
    {
      "NewsId": 4,
      "type": "Sport",
      "img": "/src/assets/Sport/messiAndronaldo.jpg",
      "subTitle": "Lionel Messi and Cristiano Ronaldo both score in thrilling exhibition match in Saudi Arabia",
      "title": "Lionel Messi and Cristiano Ronaldo put on a show as they came head to head in Paris Saint-Germain’s 5-4 win over a Riyadh All-Star XI on Thursday.",
      "description": "The exhibition match was played in Saudi Arabia’s capital and saw the two superstars renew their storied rivalry for possibly the last time.Despite being a friendly, the game was played at a furious pace as a packed out crowd inside the King Fahd Stadium was treatedto a goal-fest between the French champion and a team consisting of the best players from Saudi’sdomestic league.It was Messi who opened the scoring with a well taken finish within three minutes before Ronaldo equalized from the penalty spot after colliding with PSG goalkeeper Keylor Navas.Juan Bernat was then sent off for the French giant after bringing down Salem Al Dawsari as the last man, before defender Marquinhos reestablished PSG’s lead by turning in a wonderful cross from Kylian Mbappé. The breathtaking action continued with Neymar seeing his penalty saved before Ronaldo leveled the scores 2-2 before the break when he reacted quickest after his initial header hit the post.",
      "like": 0,
      "disLike": 0,
      "tag":"'Messi','Ronaldo','Saudi Arabia','World Cup','sports'"
    },
    {
      "NewsId": 5,
      "type": "Sport",
      "img": "/src/assets/Sport/pele.jpg",
      "subTitle": "What made Pelé so great,He was that rarity; like Muhammad Ali, Pelé was a sports star, who transcended his sport.",
      "title": "Born into poverty – he used to kick a grapefruit around Brazil’s Minas Gerais state – Pelé finished his career as arguably soccer’s greatest ever player.",
      "description": "The Brazilian brought joy and creativity to a sport often stuck in rigidity and personified o jogo bonito – “the beautiful game.” “Pele changed everything,” wrote current Brazil international Neymar Jr. after Pelé’s death was announced.“He turned football into art, into entertainment. He gave a voice to the poor, to Black people and especially. He gave visibility to Brazil.”From dazzling as a 17-year-old in 1958 on his way to his first World Cup success to claiming the Golden Ball award as player of the 1970 World Cup as he won a third global title, “O Rei” (“The King”) achieved almost everything possible in the famous yellow and blue of Brazil.And there were goals – lots of them.Pelé scored 757 goals in 812 official matches for club and country. However, there is disagreement over just how many goals he scored in his career. According to Reuters, Brazil’s football association and Santos say Pelé scored 1,283 goals in 1,367 matches, though FIFA puts the number at 1,281 goals in 1,366 games.",
      "like": 0,
      "disLike": 0,
      "tag":"'Pelé','sports','sports star'"
    },
    {
      "NewsId": 6,
      "type": "Economic",
      "img": "/src/assets/Economy/Climate crisis.jpg",
      "subTitle": "These 3 solutions could turn the tide on the climate crisis",
      "title": "Climate change is sending the world hurtling towards a series of catastrophic tipping points, which risk setting off feedback loops that lock the world into irreversible climate change. That’s the bad news.",
      "description": "The good news, however, is that there is also a series of “positive tipping points,” according to an analysis published Thursday by researchers from an international group of institutions including the University of Exeter and the World Resources Institute’s Systems Change Lab, with support from the Bezos Earth Fund.These are defined as small climate actions that could have a snowball effect, prompting emissions cuts across some of most polluting sectors of the global economy.The theory goes like this: As new technologies start to outpace older, more polluting versions, reinforcing feedback loops kick in that help a technology to improve, get cheaper and become more accessible.The idea is to create “​​self-propelling change,” Tim Lenton, Chair in Climate Change and Earth System Science at the University of Exeter and a report author, told CNN.",
      "like": 0,
      "disLike": 0,
      "tag":"'Economic',' climate crisis','sports star'"
    },
    {
      "NewsId": 7,
      "type": "Economic",
      "img": "/src/assets/Economy/new-car-prices.jpg",
      "subTitle": "Most new car buyers are now paying less than sticker price",
      "title": "Americans can once again buy cars for less than sticker price. But that doesn’t mean they’re finding bargains at their local dealerships.",
      "description": "A year ago, record tight inventories meant 80% of buyers were paying more than the manufacturers’ suggested retail price (MSRP), or sticker price, according to data from Edmunds. For decades, car buyers had been able to negotiate a discount.Today, only 36% of buyers are paying above sticker. After paying an average of $700 above MSRP in the spring, buyers paid an average of $300 less than sticker in December.That’s still far less than the $2,600 average that buyers saved on the sticker price in 2019, according to Edmunds’ data — while the average transaction price remains at a record high, according to data from both Edmunds and Cox Automotive, which both track car sales, prices and inventories.That put the average transaction price at just under $50,000 in December, up about $10,000, or 26%, from December 2019, just before the pandemic upended the new car market.",
      "like": 0,
      "disLike": 0,
      "tag":"'Economic',' car crisis'"
    },
    {
      "NewsId": 8,
      "type": "Economic",
      "img": "/src/assets/Economy/china.jpg",
      "subTitle": "China’s population is shrinking. The impact will be felt around the world",
      "title": "China may be one step closer to losing its place as the world’s most populous country to India after its population shrank for the first time since the 1960s.",
      "description": "The country’s population fell in 2022 to 1.411 billion, down some 850,000 people from the previous year, China’s National Bureau of Statistics (NBS) announced during a Tuesday briefing on annual data.The last time China’s population decreased was in 1961, during a famine that killed tens of millions of people across the country.This time, a combination of factors are behind the drop: the far-reaching consequences of the one-child policy China introduced in the 1980s (but has since abandoned); changing attitudes toward marriage and family among Chinese youth; entrenched gender inequality and the challenges of raising children in China’s expensive cities.Experts warn that, if sustained, the trend could also pose a problem for the rest of the world, with China playing a key role in driving global growth as the second-largest economy.A falling population is likely to exacerbate China’s problems with an aging workforce and drag on growth, adding to its woes as it struggles to recover from the pandemic.",
      "like": 0,
      "disLike": 0,
      "tag":"'Economic','China','population'"
    },
    {
      "NewsId": 9,
      "type": "Economic",
      "img": "/src/assets/Economy/microsoft.jpg",
      "subTitle": "Microsoft is laying off 10,000 employees",
      "title": "Microsoft plans to lay off 10,000 employees as part of broader cost-cutting measures, the company said in a securities filing on Wednesday,",
      "description": "Speaking before the layoff announcement at the World Economic Forum (WEF) in Davos, Switzerland, on Wednesday, Microsoft CEO Satya Nadella said that the company was not immune to a weaker global economy.“No one can defy gravity and gravity here is inflation-adjusted economic growth,” he told WEF founder Klaus Schwab in a livestreamed discussion.In a memo to staffers Wednesday, Nadella also cited changing demand years for digital services years into the pandemic as well as looming recession fears.“We’re living through times of significant change, and as I meet with customers and partners, a few things are clear,” he wrote. “First, as we saw customers accelerate their digital spend during the pandemic, we’re now seeing them optimize their digital spend to do more with less.”Microsoft had approximately 221,000 full-time employees globally as of June 30, 2022, according to a US Securities and Exchange Commission filing, with some 122,000 of those staffers based in the United States.Nadella said the job the cuts represent less than 5% of the company’s total workforce and the reductions will be complete by the end of its fiscal third quarter this year, which ends in March.",
      "like": 0,
      "disLike": 0,
      "tag":"'Economic','Microsoft','Financial crisis'"
    },
    {
      "NewsId": 10,
      "type": "Economic",
      "img": "/src/assets/Economy/pump .jpg",
      "subTitle": "Europe's ban on Russian diesel could send pump prices even higher",
      "title": "Europe is scrambling to buy diesel fuel from Russia before a ban on imports comes into force in early February, but the frantic stockpiling is unlikely to prevent a new price shock for truckers,",
      "description": "In the first two weeks of January, European countries snapped up almost 8 million barrels of Russian diesel, according to energy data provider Vortexa, roughly on par with imports this time last year before Russia invaded Ukraine. Imports in the fourth quarter of 2022 were up nearly 19% on the same period the previous year.Since Russia’s invasion in February last year, the European Union has made a huge effort to wean itself off Moscow’s oil and natural gas supplies. That has included a ban on all Russian seaborne crude oil imports, which came into force in December.EU countries drastically reduced their imports of crude from Russia ahead of the ban, but that isn’t happening with diesel because it’s much harder to find alternative sources of the fuel.Russia is the bloc’s biggest supplier, making up 29% of its total diesel imports last year, data from Rystad Energy shows. The fuel is the continent’s “economic workhorse,” Mark Williams, a research director at Wood Mackenzie, told CNN.It is used to power the “vast majority” of transportation for goods and commodities around Europe, he said, as well as fueling the bloc’s fleet of diesel cars. About 91% of vans and 96% of all trucks run on diesel, as well as roughly 42% of passenger cars, according to the European Automobile Manufacturer’s Association.",
      "like": 0,
      "disLike": 0,
      "tag":"'Economic','Russian','swelling','diesel','oil'"
    },
    {
      "NewsId": 11,
      "type": "Technology",
      "img": "/src/assets/Technology/apple.png",
      "subTitle": "Apple Fast Facts,Here’s a look at Apple, Inc, creator of the Mac computer and the iPhone.",
      "title": "The corporate headquarters are in Cupertino, California. As of September 2022, the company reported that it employs approximately 164,000 people full-time",
      "description": "TimelineApril 1, 1976 - Apple Computers, Inc. is founded by Steve Jobs and Steve Wozniak. Their first product is the Apple I personal computer.June 1977 - The Apple II is released.December 1980 - Apple conducts an initial public offering of 4.6 million shares at $22 per share.January 1983 - Apple introduces the Lisa, a new brand of personal computer.January 22, 1984 - The Macintosh computer is introduced with a futuristic commercial that airs during the Super Bowl.1985 - Apple discontinues the Lisa after a disappointing run, and Jobs leaves thecompany.December 1996 - Apple buys Jobs’ company, NeXT Software.1997 - In the wake of corporate shakeups and a sales slump, Apple welcomes Jobs back as interim CEO.August 15, 1998 - The iMac, a streamlined personal computer, debuts.January 2000 - Jobs becomes permanent CEO.January 9, 2001 - iTunes is introduced.October 23, 2001 - The iPod MP3 player makes its debut.",
      "like": 0,
      "disLike": 0,
      "tag":"'Technology','Apple','Steve Jobs'"
    },
    {
      "NewsId": 12,
      "type": "Technology",
      "img": "/src/assets/Technology/twitter.jpg",
      "subTitle": "With its advertising business in crisis, Twitter eases ban on political ads",
      "title": "More than three years ago, Twitter prohibited political and issue-based ads amid broader concerns that politicians could pay to target social media users with false or misleading information",
      "description": "Now, under its new owner Elon Musk, the company is easing that ban, in a move that could provide Twitter a much-needed sales boost at a time when Musk is urgently searching for new revenue streams. But it comes with some risks: the policy change could expose users to threats the company has previously said it may not be able to address, including spreading AI-created deep fakes and other sophisticated attempts to manipulate the platform.On Tuesday, Twitter announced it would relax its ban on issue ads, saying “cause-based advertising can facilitate public conversation around important topics.” Twitter added that it would “expand the political advertising we permit in the coming weeks,” with a pledge to share “more details as this work progresses.” The company said its advertising policies going forward would resemble those of other media, including television.Political advertising has never been a significant source of revenue for the company — it made less than $3 million from political ads in 2018, the year before the ban took effect. But Musk needs every little bit of revenue he can find.",
      "like": 0,
      "disLike": 0,
      "tag":"'Technology','Twitter','Elon Musk','ads'"
    },
    {
      "NewsId": 13,
      "type": "Technology",
      "img": "/src/assets/Sport/technology trends.jpg",
      "subTitle": "These are the technology trends that will shape our lives in 2023.",
      "title": "The late management guru Peter Drucker once said that “Trying to predict the future is like trying to drive down a country road at night with no lights",
      "description": "When it comes to anticipating new trends in technology, change is happening so fast that the back window may as well be fogged up.2022 saw NFTs go from flavor of the month to yesterday’s leftovers; cryptocurrency experience a long cold winter; and nuclear fusion take its first steps from the realms of science fiction towards becoming science fact.But for those who follow the latest developments in innovation, it is possible to see patterns in where societies are heading, and forecast which technologies will take them there.As we begin 2023, CNN asked four experts to predict which technologies will shape our lives this year – here’s what they said.Artificial intelligence (AI) has become part of our daily lives, found in everything from e-commerce to social media algorithms. Ayesha Khanna, co-founder and CEO of Addo, an AI and data solutions firm, predicts an explosion of AI-generated images and music in 2023. She adds that while it will not replace humans, “AI will become the new team member for humans in many jobs, contributing ideas and drafts.”",
      "like": 0,
      "disLike": 0,
      "tag":"'Technology','lives','NFTs','cryptocurrency','AI'"
    },
    {
      "NewsId": 14,
      "type": "Technology",
      "img": "/src/assets/Technology/hatgpt.jpg.jpg",
      "subTitle": "Teachers are adapting to concerns about a powerful new AI tool",
      "title": "When Kristen Asplin heard about a powerful new AI chatbot tool called ChatGPT going viral online recently with its ability to write frighteningly good essays in seconds",
      "description": "Asplin, a professor at University of Pittsburgh at Greensburg, soon joined a new Facebook group for teachers like herself to swap concerns and suggestions on how to restructure their lessons and assignments in response to ChatGPT. The tool, which launched in late November, can create detailed responses to simple prompts like “Who was the 25th president of the United States?” as well as answers to more complex questions like “What political developments led to the fall of the Roman Empire?”.Asplin eventually decided to tweak her approach to written assignments. Instead of focusing just on the final product, which could potentially be spit out easily by ChatGPT, she’s now asking students to hand in their papers at various stages of the writing process.",
      "like": 0,
      "disLike": 0,
      "tag":"'Technology','ChatGPT','NFTs','Robat','AI'"
    },
    {
      "NewsId": 15,
      "type": "Technology",
      "img": "/src/assets/Technology/intel.png",
      "subTitle": "Intel CEO: Chip supply chains will shape geopolitics more than oil over the next 50 years",
      "title": "Global politics will be dominated by the availability, trade and investment in microchips for the next several decades, Intel CEO Pat Gelsinger told CNN Tuesday.",
      "description": "The location of “oil reserves [has] defined geopolitics for the last five decades,” Gelsinger said in an interview with CNN’s Julia Chatterley at the World Economic Forum in Davos. “Where the technology supply chains are, and where semiconductors are built, is more important for the next 5 decades.” ,Gelsinger said the company’s investment in new manufacturing facilities in the United States, Europe and elsewhere is important not only for the company’sfuture, but for the “globalization of the most critical resource to the future of the world.”,“We need this geographically balanced, resilient supply chain,” he said.Intel (INTC) said last year it would invest $20 billion to build two new US chipmaking facilities, as well as up to $90 billion in new European factories, aimed at reasserting its position as the leader of the semiconductor industry. The announcements also came amid concerns about the concentration of manufacturing for chips, in Asia, particularly China and Taiwan, during the Covid-19 pandemic and as geopolitical tensions grew. Issues in the chip supply chain in recent years have caused shortages and shipping delays of everything from desktop computers and iPhones to cars.",
      "like": 0,
      "disLike": 0,
      "tag":"'Technology','Intel','Chip'"
    }
  ],
  "newsComment":[
    {
      "commentId":1,
      "newsId":1,
      "userName":"hamidchoopani",
      "comment":"good News",
      "dateTime":"2022/01/01"
    }

  ],
  "typeNews": [
    {
      "TypeNewsId": 1,
      "title": "Technology",
      "link": "technology"
    },
    {
      "TypeNewsId": 2,
      "title": "Sport",
      "link": "Home"
    },
    {
      "TypeNewsId": 3,
      "title": "Economic",
      "link": "Economic"
    }
  ],
  "user": [
    {
      "UserId": 1,
      "userName":"hamidchoopani",
      "email": "hamid@gmail.com",
      "password": "12345"
    }
  ],
  "ContactUs":[
    {
      "id":1,
      "email":"hamid@gmail.com",
      "message":"thank you for good website"
    }
  ]
}